[
  {
    "x": 0,
    "y": 0,
    "id": "wooden_plank",
    "name": "wooden plank",
    "isGettable": true, 
    "isInInventory": false,
    "notify": true,
    "examine": "A flat plank of worn wood that was once part of the sunken boat. It's small enough to carry under your arm.",
    "use": {
      "x": 2,
      "y": -2,
      "result": "You lay the plank across the river, resting it on the supports of the former bridge. It's not perfect, but it looks sturdy enough to hold your weight.",
      "hook": "hook_wooden_plank",
      "deleteAfter": true
    }
  },
  {
    "x": 0,
    "y": 0,
    "id": "sunken_boat",
    "name": "sunken boat",
    "isGettable": false, 
    "isInInventory": false,
    "notify": false,
    "examine": "On the horizon, you can see what remains of the old fishing boat that brought you here. The cabin and the railings jut out of the roiling waves, bent and broken amid jagged rocks.||You were foolish to have gone out in the storm alone, and lucky to have survived and made it to shore.",
    "use": false
  },  
  {
    "x": 0,
    "y": -1,
    "id": "grass",
    "name": "grass",
    "isGettable": false, 
    "isInInventory": false,
    "notify": false,
    "examine": "Just regular grass. It doesn't seem interesting or useful.",
    "use": false
  },
  {
    "x": 0,
    "y": -2,
    "id": "hatchet",
    "name": "hatchet",
    "isGettable": true, 
    "isInInventory": false,
    "notify": true,
    "examine": "A small hatchet, with a worn wooden handle and a sharpened metal head.",
    "use": {
      "x": 4,
      "y": -4,
      "result": "You swing the hatchet hard against the trap door several times. The wood splinters, and with a 'clunk' the lock gives way. Grabbing the handle, you swing the trap door open to reveal a ladder leading down into darkness.",
      "hook": "hook_hatchet_trap_door",
      "deleteAfter": false
    }
  },
  {
    "x": 4,
    "y": -4,
    "id": "kerosene_lantern",
    "name": "kerosene lantern",
    "isGettable": true, 
    "isInInventory": false,
    "notify": true,
    "examine": "An old kerosene lantern, with a wire handle on top for easy carrying. The fuel tank is empty, but otherwise it seems to be in good condition.",
    "use": {
      "x": 4,
      "y": -5,
      "result": "There is no fuel in the lantern, and you have nothing to light it with.",
      "deleteAfter": false
    }
  },
  {
    "x": 4,
    "y": -4,
    "id": "trap_door",
    "name": "trap door",
    "isGettable": false, 
    "isInInventory": false,
    "notify": true,
    "examine": "A square cut out of the floor boards, with a handle and hinges visible. You tug on the handle, but it appears to be locked tight.",
    "use": false
  },
  {
    "x": 4,
    "y": -5,
    "id": "ladder",
    "name": "ladder",
    "isGettable": false, 
    "isInInventory": false,
    "notify": false,
    "examine": "A metal ladder extending upwards through a trap door in the ceiling.",
    "use": {
      "x": 4,
      "y": -5,
      "result": "You grab the rungs of the ladder and climb upwards, through the trap door in the ceiling.",
      "hook": "hook_ladder",
      "deleteAfter": false
    }
  }
]