[
  {
    "x": 0,
    "y": 0,
    "name": "a rocky beach",
    "desc": "You are standing on a rocky beach. Waves crash against the shore. In the deeper water, there are the shattered remnants of a sunken boat — your boat.",
    "dirs": {
      "north": true,
      "east": true,
      "south": false,
      "west": false
    },
    "img": false
  },
  {
    "x": 0,
    "y": -1,
    "name": "a narrow path",
    "desc": "You are on a narrow path, barely visible through sandy soil. On either side of the path, long grass sways in the breeze.",
    "dirs": {
      "north": true,
      "east": false,
      "south": true,
      "west": false
    }
  },
  {
    "x": 0,
    "y": -2,
    "name": "a small clearing",
    "desc": "You are in a small clearing outside a shack. The ground is sandy and unkempt.",
    "dirs": {
      "north": true,
      "east": true,
      "south": true,
      "west": false
    }
  },
  {
    "x": 0,
    "y": -3,
    "name": "an old shack",
    "desc": "You are inside an old shack. There's a mattress on a small creaky boxspring, and a counter with a washbasin and some kitchen utensils.\n\nIt's dusty and basic, but this shack is a safe shelter from the elements.",
    "dirs": {
      "north": false,
      "east": false,
      "south": true,
      "west": false
    }
  },
  {
    "x": 1,
    "y": -2,
    "name": "a rough road",
    "desc": "You are on a rough road cut through weeds and brush. You can see evidence of wheel ruts in the hard-packed dirt.",
    "dirs": {
      "north": false,
      "east": true,
      "south": false,
      "west": true
    }
  },
  {
    "x": 2,
    "y": -2,
    "name": "a riverbank",
    "desc": "You are at the edge of a riverbank. The water is flowing rapidly and looks a bit too wide to cross safely. \n\nIt looks like there used to be a bridge to the east, but the planks have fallen into the water. \n\nA smaller footpath heads north.",
    "dirs": {
      "north": true,
      "east": false,
      "south": false,
      "west": true
    }
  },
  {
    "x": 2,
    "y": -3,
    "name": "foot of a cliff",
    "desc": "You are on a dirt trail and that ends at the foot of a high, rocky cliff. At the foot of the cliff you can glimpse a dark crevice in the rocks.",
    "dirs": {
      "north": false,
      "east": false,
      "south": true,
      "west": false
    }
  },
  {
    "x": 3,
    "y": -2,
    "name": "a bridge",
    "desc": "You stand on the planks of a small wooden bridge. Below the wooden planks, a turbulent river rushes by.",
    "dirs": {
      "north": false,
      "east": true,
      "south": false,
      "west": false
    }
  },
  {
    "x": 1,
    "y": 0,
    "name": "a swamp",
    "desc": "You are up to your knees in a mucky swamp. Mosquitoes buzz around your head.",
    "dirs": {
      "north": false,
      "east": false,
      "south": false,
      "west": true
    }
  },
  {
    "x": 4,
    "y": -2,
    "name": "a grassy field",
    "desc": "You stand on a grassy field on the eastern bank of a rushing river. It's calm and peaceful here.",
    "dirs": {
      "north": true,
      "east": false,
      "south": false,
      "west": true
    }
  },
  {
    "x": 4,
    "y": -3,
    "name": "a steep hill",
    "desc": "You are standing on a steep hill, just outside a stone lighthouse. The door on the ground floor of the lighthouse is ajar, and its grey walls tower above you.",
    "dirs": {
      "north": true,
      "east": false,
      "south": true,
      "west": false
    }
  },
  {
    "x": 4,
    "y": -4,
    "name": "a lighthouse",
    "desc": "You're inside an old stone lighthouse. Beams of light shine down through the windows far above. The floor is dusty and strewn with junk. It seems nobody has been in here for years.",
    "dirs": {
      "north": false,
      "east": false,
      "south": true,
      "west": false
    }
  },
  {
    "x": 4,
    "y": -5,
    "name": "the lighthouse cellar",
    "desc": "You are in the cellar of the stone lighthouse. The stone walls are damp and lined with moss, and it's much colder down here than it was above.\n\nA ladder leads up to a trap door in the ceiling, the only source of dim light in this room.\n\nIt looks like there might be a tunnel heading west, but it's too dark to explore it safely.",
    "dirs": {
      "north": false,
      "east": false,
      "south": false,
      "west": false
    }
  }
]